print("Привіт! Це невелика анкета, що трохи про мене розповість. Напишіть фразу, і програма дасть Вам відповідь.")
print("Ось фрази, які Ви можете написати:\n", "- Чим я займаюся?\n", "- Мій вік\n", "- Як мене звати?\n", "- Моє не точне місцезнаходження?\n", "- Чи часто ти користуєшся Python?\n", "Для виходу введіть 'Вихід'.\n")
    
vidpovidi = {
        "Чим я займаюся?": "Я навчаюся в КТГГ!",
        "Мій вік": "Мені 16.",
        "Як мене звати?": "Мене звати Владислав Кочерга!",
        "Чи ти часто користуєшся Python?": "Останній раз я користувався нею, щоб зробити цю анкету)",
        "Моє не точне місцезнаходження?": "Я живу в Україні!"
        #Список питань і відповідей
    }
    
while True:
        # Запит у користувача
    user_input = input("Ваша фраза: ")
        
        # Перевірка на вихід
    if user_input == "Вихід":
        print("До побачення!")
        break
        
        # Відповідь на питання або повідомлення про помилку
    if user_input in vidpovidi:
        print(vidpovidi[user_input])
    else:
        print("Я не знаю, як на це відповісти. Спробуйте іншу фразу.")
