print('Вітаю! Це невелика анкета, дасть вам основні відомості про мене!)')
name = "Владислав Кочерга"
occupation = "я навчаюсь в КТГГ!"
location = "в Київській області"
age = "мені 16 років"
hobby = "я збираю міні-моделі історичної техніки"

user_input = input("Введіть будь-яку фразу щоб перейти до анкети: ")

# Відповідь на фразу
print("\n--- Відповідь на вашу фразу ---")
print(f"Мене звати: {name}")
print(f"Я займаюсь: {occupation}")
print(f"Я живу: {location}")
print(f"Мій вік: {age}")
print(f"Моє хобі: {hobby}")
print("--------------------------------")